import sqlite3
import csv
connection = sqlite3.connect("taperental.db")
cursor = connection.cursor()
cursor.execute("PRAGMA foreign_keys = ON")
cursor.execute("""DROP TABLE IF EXISTS users""")
cursor.execute("DROP TABLE IF EXISTS tapes")
cursor.execute("DROP TABLE IF EXISTS rental")
cursor.execute("""CREATE TABLE users(
id INTEGER PRIMARY KEY AUTOINCREMENT,
name TEXT NOT NULL,
age NOT NULL
)
""")
cursor.execute("""CREATE TABLE tapes(
id INTEGER PRIMARY KEY AUTOINCREMENT,
title TEXT NOT NULL,
year INTEGER NOT NULL,
genre TEXT NOT NULL,
director TEXT NOT NULL
)
""")
cursor.execute(""" CREATE TABLE rental(
id INTEGER PRIMARY KEY AUTOINCREMENT,
user_id INTEGER NOT NULL,
tape_id INTEGER NOT NULL,
borrowing_date TEXT NOT NULL,
return_date TEXT NOT NULL,
FOREIGN KEY (user_id) REFERENCES users(id),
FOREIGN KEY (tape_id) REFERENCES tapes(id)
)
""")
print("Введите имя")
usersname = input()
print("Введите возраст")
usersage = int(input())
cursor.execute(""" 
INSERT INTO users (name, age)
VALUES (?, ?)
""", (usersname, usersage))
print("Введите название фильма")
tape_title = input()
print("Введите год выпуска")
tape_year = int(input())
print("Введите режиссера")
tape_director = input()
print("Введите жанр")
tape_genre = input()
cursor.execute("""
INSERT INTO tapes (title, year, genre, director)
VALUES (?,?,?,?)
""",(tape_title, tape_year,tape_genre, tape_director))

cursor.execute("""
INSERT INTO users (name, age)
VALUES ("Саша", 14)
""")
cursor.execute("""
INSERT INTO tapes (title, year, genre, director)
VALUES ("зеленый слоник", 1999, "Ужасы/Комедия", "Светлана Баскова") 
""")
cursor.execute("""
INSERT INTO users (name, age)
VALUES ("Рома", 22)
""")
cursor.execute("""
INSERT INTO users (name, age)
VALUES ("Кирилл", 19)
""")
cursor.execute("""
INSERT INTO users (name, age)
VALUES ("Игнат", 47)
""")
users_array = [
    ("Маша", 32), ("Паша", 13), ("Миша", 22), ("Серафим", 25), ("Павел", 14), ("Егор", 16), ("Емеля", 23),
    ("Петя", 17), ("Федя", 45), ("Максим", 17), ("Платон", 11), ("Руслан", 24), ("Георгий", 18), ("Сергей", 17),
    ("Виталик", 15), ("Григорий", 19), ("Ахмед", 32), ("Оксана", 48), ("Амир", 50), ("Ваня",21), ("Рафаэль", 25),
    ("Артур", 18), ("Гоша", 35), ("Людмила", 33), ("Кира", 33), ("Михаил", 29), ("Иманбек", 27), ("Николай", 20),
    ("Алексей", 17), ("Вадим", 14),
]
cursor.executemany("""
INSERT INTO users (name, age)
VALUES (?,?)
""", users_array)
tapes_array =[
("Побег из Шоушенка", 1994, "Драма", "Фрэнк Дарабонт"),
    ("Зелёная миля", 1999, "Драма", "Фрэнк Дарабонт"),
    ("Форрест Гамп", 1994, "Драма", "Роберт Земекис"),
    ("Начало", 2010, "Фантастика", "Кристофер Нолан"),
    ("Интерстеллар", 2014, "Фантастика", "Кристофер Нолан"),
    ("Тёмный рыцарь", 2008, "Боевик", "Кристофер Нолан"),
    ("Властелин колец: Возвращение короля", 2003, "Фэнтези", "Питер Джексон"),
    ("Матрица", 1999, "Фантастика", "Лана и Лилли Вачовски"),
    ("Бойцовский клуб", 1999, "Драма", "Дэвид Финчер"),
    ("Назад в будущее", 1985, "Фантастика", "Роберт Земекис"),
    ("Список Шиндлера", 1993, "Драма", "Стивен Спилберг"),
    ("Престиж", 2006, "Драма", "Кристофер Нолан"),
    ("Гладиатор", 2000, "Боевик", "Ридли Скотт"),
    ("Большой куш", 2000, "Криминал", "Гай Ричи"),
    ("Иван Васильевич меняет профессию", 1973, "Комедия", "Леонид Гайдай"),
    ("Москва слезам не верит", 1979, "Мелодрама", "Владимир Меньшов"),
    ("Брат", 1997, "Криминал", "Алексей Балабанов"),
    ("Операция «Ы» и другие приключения Шурика", 1965, "Комедия", "Леонид Гайдай"),
    ("Сияние", 1980, "Ужасы", "Стэнли Кубрик"),
    ("Леон", 1994, "Боевик", "Люк Бессон"),
    ("Аватар", 2009, "Фантастика", "Джеймс Кэмерон"),
    ("Титаник", 1997, "Драма", "Джеймс Кэмерон"),
    ("Пираты Карибского моря: Проклятие Чёрной жемчужины", 2003, "Приключения", "Гор Вербински"),
    ("Служебный роман", 1977, "Комедия", "Эльдар Рязанов"),
    ("Джентльмены удачи", 1971, "Комедия", "Александр Серый"),
    ("Терминатор 2: Судный день", 1991, "Фантастика", "Джеймс Кэмерон"),
    ("Бегущий по лезвию", 1982, "Фантастика", "Ридли Скотт"),
    ("Остров проклятых", 2009, "Триллер", "Мартин Скорсезе"),
    ("Карты, деньги, два ствола", 1998, "Криминал", "Гай Ричи")
]
cursor.executemany("""
INSERT INTO tapes (title, year, genre, director)
VALUES(?,?,?,?)
""", tapes_array)
rental_array = [
(1, 1, "2024-01-10", "2024-01-20"),
    (2, 2, "2024-01-12", "2024-01-22"),
    (3, 3, "2024-01-15", "2024-01-25"),
    (4, 4, "2024-01-18", "2024-01-28"),
    (5, 5, "2024-01-20", "2024-01-30"),
    (6, 6, "2024-01-22", "2024-02-01"),
    (7, 7, "2024-01-25", "2024-02-04"),
    (8, 8, "2024-01-28", "2024-02-07"),
    (9, 9, "2024-01-30", "2024-02-09"),
    (10, 10, "2024-01-31", "2024-02-10"),
    (11, 11, "2024-02-03", "2024-02-13"),
    (12, 12, "2024-02-05", "2024-02-15"),
    (13, 13, "2024-02-07", "2024-02-17"),
    (14, 14, "2024-02-10", "2024-02-20"),
    (15, 15, "2024-03-15", "2024-03-25"),
    (16, 16, "2024-03-18", "2024-03-28"),
    (17, 17, "2024-03-25", "2024-04-04"),
    (18, 18, "2024-03-31", "2024-04-15"),
    (19, 19, "2024-03-31", "2024-04-15"),
    (20, 20, "2024-04-12", "2024-04-14"),
    (21, 21, "2024-05-03", "2024-06-01"),
    (22, 22, "2024-05-17", "2024-05-24"),
    (23, 23, "2024-05-31", "2024-06-03"),
    (24, 24, "2024-06-09", "2024-06-11"),
    (25, 25, "2024-06-22", "2024-06-30"),
    (26, 26, "2024-06-26", "2024-07-01"),
    (27, 27, "2024-07-02", "2024-07-11"),
    (28, 28, "2024-07-05", "2024-07-15"),
    (29, 29, "2024-07-16", "2024-08-03"),
    (30, 30, "2024-07-29", "2024-08-07")
]
cursor.executemany("""
INSERT INTO rental (user_id, tape_id, borrowing_date, return_date)
VALUES(?,?,?,?)
""", rental_array)
connection.commit()
connection.close()